gillwei7/NXP_RT600/boards/mimxrt685audevk/dsp_examples/xaf_usb_demo/cm33/source/cmd.c
/*
 * Copyright 2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*${header:start}*/
#include "cmd.h"
#include "dsp_ipc.h"

#include <string.h>
#include <stdint.h>
#include "fsl_debug_console.h"
#include "fsl_shell.h"

#include "composite.h"
/*${header:end}*/

/*******************************************************************************
 * Definitions
 ******************************************************************************/
/*${macro:start}*/

/*${macro:end}*/

/*******************************************************************************
 * Prototypes
 ******************************************************************************/

/*${prototype:start}*/
static void initMessage(srtm_message *msg);

static shell_status_t shellEcho(shell_handle_t shellHandle, int32_t argc, char **argv);
static shell_status_t shellUsbSpeaker(shell_handle_t shellHandle, int32_t argc, char **argv);
static shell_status_t shellUsbMic(shell_handle_t shellHandle, int32_t argc, char **argv);
// TYM DSP add >>
static shell_status_t shellFlowDSP(shell_handle_t shellHandle, int32_t argc, char **argv);
static shell_status_t shellLineInOut(shell_handle_t shellHandle, int32_t argc, char **argv);
// TYM DSP add <<
#if XA_CLIENT_PROXY
static shell_status_t shellEAPeffect(shell_handle_t shellHandle, int32_t argc, char **argv);
#endif

/*${prototype:end}*/

/*******************************************************************************
 * Variables
 ******************************************************************************/
extern usb_device_composite_struct_t g_composite;
extern uint8_t *audioPlayDataBuff;
extern uint8_t *audioPlayDMATempBuff;
extern uint8_t *audioRecDataBuff;
extern uint8_t *audioRecDMATempBuff;

/*${variable:start}*/
SHELL_COMMAND_DEFINE(version, "\r\n\"version\": Query DSP for component versions\r\n", shellEcho, 0);
SHELL_COMMAND_DEFINE(usb_speaker,
                     "\r\n\"usb_speaker\": Perform usb speaker device and playback on DSP\r\n"
                     "  USAGE: usb_speaker [start|stop]\r\n"
                     "    start          Start usb speaker device and playback on DSP\r\n"
                     "    stop           Stop usb speaker device and playback on DSP\r\n",
                     shellUsbSpeaker,
                     1);

#if XA_CLIENT_PROXY
SHELL_COMMAND_DEFINE(eap,
                     "\r\n\"eap\": Set EAP parameters\r\n"
                     "  USAGE: eap [1|2|3|4|5|6|7|+|-|l|r]\r\n"
                     "  OPTIONS:\r\n"
                     "    1:	All effect Off \r\n"
                     "    2:	Voice enhancer \r\n"
                     "    3:	Music enhancer \r\n"
                     "    4:	Auto volume leveler \r\n"
                     "    5:	Loudness maximiser  \r\n"
                     "    6:	3D Concert sound  \r\n"
                     "    7:	Custom\r\n"
                     "    8:	Tone Generator\r\n"
                     "    9:	Crossover 2 way speaker\r\n"
                     "   10:	Crossover for subwoofer\r\n"
                     "    +:	Volume up\r\n"
                     "    -:	Volume down\r\n"
                     "    l:	Balance left\r\n"
                     "    r:	Balance right\r\n",
                     shellEAPeffect,
                     1);
#endif

SHELL_COMMAND_DEFINE(usb_mic,
                     "\r\n\"usb_mic\": Record DMIC audio and playback on usb microphone audio device\r\n"
                     "  USAGE: usb_mic [start|stop]\r\n"
                     "    start          Start record and playback on usb microphone audio device\r\n"
                     "    stop           Stop record and playback on usb microphone audio device\r\n",
                     shellUsbMic,
                     1);
// TYM DSP add >>
SHELL_COMMAND_DEFINE(flow, "\r\n\"flow\": Send command to control FlowDSP param\r\n", shellFlowDSP, 2);
SHELL_COMMAND_DEFINE(line,
					 "\r\n\"line\": Perform line in & out and playback on DSP\r\n"
					 "  USAGE: line [start]\r\n"
					 "	  start			Start line in & out and playback on DSP\r\n",
					 shellLineInOut,
					 1);
// TYM DSP add <<
static bool usb_playing   = false;
static bool usb_recording = false;

SDK_ALIGN(static uint8_t s_shellHandleBuffer[SHELL_HANDLE_SIZE], 4);
static shell_handle_t s_shellHandle;

extern serial_handle_t g_serialHandle;
static handleShellMessageCallback_t *g_handleShellMessageCallback;
static void *g_handleShellMessageCallbackData;
// TYM FW add >>
extern int8_t FlowCmdStep;
// TYM FW add <<
/*${variable:end}*/

/*******************************************************************************
 * Code
 ******************************************************************************/

/*${function:start}*/
static void initMessage(srtm_message *msg)
{
    /* Common field for command */
    /* For single command, command list not used at the moment */
    msg->head.type = SRTM_MessageTypeRequest;

    msg->head.majorVersion = SRTM_VERSION_MAJOR;
    msg->head.minorVersion = SRTM_VERSION_MINOR;
}

static shell_status_t shellEcho(shell_handle_t shellHandle, int32_t argc, char **argv)
{
    srtm_message msg = {0};
    initMessage(&msg);

    msg.head.category = SRTM_MessageCategory_GENERAL;
    msg.head.command  = SRTM_Command_ECHO;

    g_handleShellMessageCallback(&msg, g_handleShellMessageCallbackData);
    return kStatus_SHELL_Success;
}

static shell_status_t shellUsbSpeaker(shell_handle_t shellHandle, int32_t argc, char **argv)
{
    srtm_message msg = {0};

    initMessage(&msg);

    msg.head.category = SRTM_MessageCategory_AUDIO;

    if (strcmp(argv[1], "start") == 0)
    {
        if (usb_recording)
        {
            PRINTF("Stop the USB microphone first, then start the USB speaker again\r\n");
            return kStatus_SHELL_Error;
        }
        if (!usb_playing)
        {
            USB_DeviceAudioSpeakerStatusReset();
            USB_DeviceRun(g_composite.deviceHandle);
            usb_playing = true;

            /* Small delay for USB starting */
            TickType_t timeTMP = xTaskGetTickCount();
            while (xTaskGetTickCount() < (timeTMP + 500))
            {
                ;
            }

            /* Clear buffers */
            memset(audioPlayDataBuff, 0, AUDIO_SHARED_BUFFER_1_SIZE);

