gillwei7/NXP_RT600/boards/mimxrt685audevk/dsp_examples/xaf_usb_demo/cm33/source/cmd.c
            msg.head.command = SRTM_Command_UsbSpeakerStart;

            /* Param 0 input buffer address */
            /* Param 1 input buffer size */
            /* Param 2 number of channels */
            /* Param 3 sampling_rate */
            /* Param 4 pcm_width */
            msg.param[0] = (uint32_t)(&audioPlayDataBuff[0]);
#if 0
            msg.param[1] = 2 * ((0U != g_composite.audioUnified.audioPlayTransferSize) ?
                                    g_composite.audioUnified.audioPlayTransferSize :
                                    HS_ISO_OUT_ENDP_PACKET_SIZE);
            msg.param[2] = AUDIO_IN_FORMAT_CHANNELS;
            msg.param[3] = AUDIO_IN_SAMPLING_RATE;
            msg.param[4] = AUDIO_IN_FORMAT_BITS;
#else
            // TYM DSP add tofu>>
            msg.param[1] = 1024;
            msg.param[2] = 8;
            msg.param[3] = 48000;
            msg.param[4] = 32;
            // TYM DSP add tofu<<
#endif

            g_handleShellMessageCallback(&msg, g_handleShellMessageCallbackData);
        }
        else
        {
            PRINTF("USB is already playing \r\n");
            return kStatus_SHELL_Error;
        }
    }
    else if (strcmp(argv[1], "stop") == 0)
    {
        if (usb_playing)
        {
            msg.head.command = SRTM_Command_UsbSpeakerStop;
            g_handleShellMessageCallback(&msg, g_handleShellMessageCallbackData);
            return kStatus_SHELL_Success;
        }
        else
        {
            PRINTF("USB is not playing \r\n");
            return kStatus_SHELL_Error;
        }
    }
    else
    {
        PRINTF("Unknown parameter\r\n");
        return kStatus_SHELL_Error;
    }

    return kStatus_SHELL_Success;
}

static shell_status_t shellUsbMic(shell_handle_t shellHandle, int32_t argc, char **argv)
{
    srtm_message msg = {0};

    initMessage(&msg);

    msg.head.category = SRTM_MessageCategory_AUDIO;

    if (strcmp(argv[1], "start") == 0)
    {
        if (usb_playing)
        {
            PRINTF("Stop the USB speaker first, then start the USB microphone again\r\n");
            return kStatus_SHELL_Error;
        }
        if (!usb_recording)
        {
            USB_DeviceAudioRecorderStatusReset();
            USB_DeviceRun(g_composite.deviceHandle);
            usb_recording = true;

            /* Small delay for USB starting */
            TickType_t timeTMP = xTaskGetTickCount();
            while (xTaskGetTickCount() < (timeTMP + 500))
            {
                ;
            }

            /* Clear buffers */
            memset(audioRecDataBuff, 0, AUDIO_SHARED_BUFFER_2_SIZE);

            msg.head.command = SRTM_Command_UsbMicStart;

            /* Param 0 output buffer address */
            /* Param 1 output buffer size */
            /* Param 2 number of channels */
            /* Param 3 sampling_rate */
            /* Param 4 pcm_width */
            msg.param[0] = (uint32_t)(&audioRecDataBuff[0]);
            msg.param[1] = AUDIO_RECORDER_DATA_WHOLE_BUFFER_COUNT_NORMAL * FS_ISO_IN_ENDP_PACKET_SIZE;
            msg.param[2] = AUDIO_IN_FORMAT_CHANNELS;
            msg.param[3] = AUDIO_IN_SAMPLING_RATE;
            msg.param[4] = AUDIO_IN_FORMAT_BITS;

            g_handleShellMessageCallback(&msg, g_handleShellMessageCallbackData);
        }
        else
        {
            PRINTF("USB is already recording\r\n");
            return kStatus_SHELL_Error;
        }
    }
    else if (strcmp(argv[1], "stop") == 0)
    {
        if (usb_recording)
        {
            msg.head.command = SRTM_Command_UsbMicStop;
            g_handleShellMessageCallback(&msg, g_handleShellMessageCallbackData);
            return kStatus_SHELL_Success;
        }
        else
        {
            PRINTF("USB is not recording\r\n");
            return kStatus_SHELL_Error;
        }
    }
    else
    {
        PRINTF("Unknown parameter\r\n");
        return kStatus_SHELL_Error;
    }

    return kStatus_SHELL_Success;
}

#if XA_CLIENT_PROXY
static shell_status_t shellEAPeffect(shell_handle_t shellHandle, int32_t argc, char **argv)
{
    srtm_message msg = {0};
    int effectNum    = atoi(argv[1]);
    initMessage(&msg);

    msg.head.category = SRTM_MessageCategory_AUDIO;
    msg.head.command  = SRTM_Command_FilterCfg;
    /* Param 0 Number of EAP config*/

    if (effectNum > 0 && effectNum < 11)
    {
        msg.param[0] = effectNum;
        g_handleShellMessageCallback(&msg, g_handleShellMessageCallbackData);
        return kStatus_SHELL_Success;
    }
    else if (strcmp(argv[1], "+") == 0)
    {
        msg.param[0] = 11;
        g_handleShellMessageCallback(&msg, g_handleShellMessageCallbackData);
        return kStatus_SHELL_Success;
    }
    else if (strcmp(argv[1], "-") == 0)
    {
        msg.param[0] = 12;
        g_handleShellMessageCallback(&msg, g_handleShellMessageCallbackData);
        return kStatus_SHELL_Success;
    }
    else if (strcmp(argv[1], "l") == 0)
    {
        msg.param[0] = 13;
        g_handleShellMessageCallback(&msg, g_handleShellMessageCallbackData);
        return kStatus_SHELL_Success;
    }
    else if (strcmp(argv[1], "r") == 0)
    {
        msg.param[0] = 14;
        g_handleShellMessageCallback(&msg, g_handleShellMessageCallbackData);
        return kStatus_SHELL_Success;
    }
    else
    {
        PRINTF("Effect parameter is out of range! Please see help. \r\n");
        return kStatus_SHELL_Error;
    }
}
#endif
// TYM FW add >>
static shell_status_t shellFlowDSP(shell_handle_t shellHandle, int32_t argc, char **argv)
{
#if 0
    srtm_message msg = {0};

    initMessage(&msg);

    msg.head.category = SRTM_MessageCategory_FLOWCMD;
    msg.head.command = SRTM_Command_FlowDSPSetParam;
    if (usb_playing)
    {
		PRINTF("[CM33] Send flow command. \r\n");
		msg.flow_msg = (char *) argv[1];
		msg.param[0] = atoi(argv[2]);

		g_handleShellMessageCallback(&msg, g_handleShellMessageCallbackData);
    }
    else
    {
    	PRINTF("[CM33] USB audio is not ready. \r\n");
    }
    return kStatus_SHELL_Success;
#endif
}

static shell_status_t shellLineInOut(shell_handle_t shellHandle, int32_t argc, char **argv)
{
    srtm_message msg = {0};

    initMessage(&msg);

    msg.head.category = SRTM_MessageCategory_AUDIO;
    msg.head.command = SRTM_Command_LINEINOUT;

    /* Param 0 Number of Channels*/
    /* Param 1 Sampling Rate*/
    /* Param 2 PCM bit Width*/

