gillwei7/NXP_RT600/boards/mimxrt685audevk/dsp_examples/xaf_usb_demo/cm33/source/cmd.c
    msg.param[0] = 8;		// TYM DSP set for TDM
    msg.param[1] = 48000;	// TYM DSP chg from 16k to 48k
//    msg.param[1] = 16000;	// DMIC in 16k
    msg.param[2] = 32;		// TYM DSP set for TDM
    PRINTF("[TYM][CM33] Send shellLineInOut command %d, %d, %d. \r\n",msg.param[0], msg.param[1], msg.param[2]);

    g_handleShellMessageCallback(&msg, g_handleShellMessageCallbackData);

    return kStatus_SHELL_Success;
}
// TYM DSP add <<
void send_FlowPathInit_Cmd(char flowPathInitChar)
{
	srtm_message msg = {0};
    msg.head.type = SRTM_MessageTypeRequest;
    msg.head.majorVersion = SRTM_VERSION_MAJOR;
    msg.head.minorVersion = SRTM_VERSION_MINOR;
    msg.head.category = SRTM_MessageCategory_FLOWCMD;
    msg.head.command = SRTM_Command_FlowDSPSetParam;
    msg.flow_msg[0] = flowPathInitChar;
    msg.param[0] = 1;

    g_handleShellMessageCallback(&msg, g_handleShellMessageCallbackData);
}
void send_FlowStudio_Cmd(char* flowCmdCharPtr, uint32_t cmdLength)
{
    srtm_message msg = {0};
    msg.head.type = SRTM_MessageTypeRequest;
    msg.head.majorVersion = SRTM_VERSION_MAJOR;
    msg.head.minorVersion = SRTM_VERSION_MINOR;
    msg.head.category = SRTM_MessageCategory_FLOWCMD;
    msg.head.command = SRTM_Command_FlowDSPSetParam;
    memcpy(msg.flow_msg, flowCmdCharPtr, cmdLength);
    msg.param[0] = cmdLength;

    g_handleShellMessageCallback(&msg, g_handleShellMessageCallbackData);
}
// TYM FW add <<

void shellCmd(handleShellMessageCallback_t *handleShellMessageCallback, void *arg)
{
    /* Init SHELL */
    s_shellHandle = &s_shellHandleBuffer[0];
    SHELL_Init(s_shellHandle, g_serialHandle, ">> ");

    /* Add new command to commands list */
    SHELL_RegisterCommand(s_shellHandle, SHELL_COMMAND(version));
    SHELL_RegisterCommand(s_shellHandle, SHELL_COMMAND(usb_speaker));
#if XA_CLIENT_PROXY
    SHELL_RegisterCommand(s_shellHandle, SHELL_COMMAND(eap));
#endif
    SHELL_RegisterCommand(s_shellHandle, SHELL_COMMAND(usb_mic));
    // TYM DSP add >>
    SHELL_RegisterCommand(s_shellHandle, SHELL_COMMAND(flow));
    SHELL_RegisterCommand(s_shellHandle, SHELL_COMMAND(line));
    // TYM DSP add <<
    g_handleShellMessageCallback     = handleShellMessageCallback;
    g_handleShellMessageCallbackData = arg;

#if !(defined(SHELL_NON_BLOCKING_MODE) && (SHELL_NON_BLOCKING_MODE > 0U))
    SHELL_Task(s_shellHandle);
#endif
}

static void handleDSPMessageInner(app_handle_t *app, srtm_message *msg, bool *notify_shell)
{
    uint32_t audioSpeakerPreReadDataCount = 0U;
    uint32_t preAudioSendCount            = 0U;
    *notify_shell                         = true;

    char string_buff[SRTM_CMD_PARAMS_MAX];

    if (msg->head.type == SRTM_MessageTypeResponse)
    {
        // Need to comment for Flow studio using
        //PRINTF("[APP_DSP_IPC_Task] response from DSP, cmd: %d, error: %d\r\n", msg->head.command, msg->error);
    }

    /* Processing returned data*/
    switch (msg->head.category)
    {
        case SRTM_MessageCategory_GENERAL:
            switch (msg->head.command)
            {
                /* echo returns version info of key components*/
                case SRTM_Command_ECHO:
                    PRINTF("Component versions from DSP:\r\n");
                    PRINTF("Audio Framework version %d.%d \r\n", msg->param[0] >> 16, msg->param[0] & 0xFF);
                    PRINTF("Audio Framework API version %d.%d\r\n", msg->param[1] >> 16, msg->param[1] & 0xFF);
                    PRINTF("NatureDSP Lib version %d.%d\r\n", msg->param[2] >> 16, msg->param[2] & 0xFF);
                    PRINTF("NatureDSP API version %d.%d\r\n", msg->param[3] >> 16, msg->param[3] & 0xFF);
                    break;

                case SRTM_Command_SYST:
                    break;
                default:
                    PRINTF("Incoming unknown message command %d from category %d \r\n", msg->head.command,
                           msg->head.category);
            }
            break;

        case SRTM_MessageCategory_AUDIO:
            if (usb_playing && (msg->head.command != SRTM_Command_FilterCfg) && (msg->head.command != SRTM_Command_FlowDSPSetParam) &&
                (msg->head.command < SRTM_Command_UsbSpeakerStart || msg->head.command > SRTM_Command_UsbSpeakerError))
            {
                PRINTF("This command cannot be processed at this time because USB is being played!\r\n");
                break;
            }
            else if (!usb_playing && msg->head.command == SRTM_Command_FilterCfg)
            {
                PRINTF("Please play usb first, then apply an EAP preset.\r\n");
                break;
            }
            switch (msg->head.command)
            {
                case SRTM_Print_String:
                    for (int i = 0; i < SRTM_CMD_PARAMS_MAX; i++)
                    {
                        string_buff[i] = (char)msg->param[i];
                    }
                    PRINTF("%s", string_buff);
                    break;

                case SRTM_Command_UsbSpeakerStart:
                    if (msg->error != SRTM_Status_Success)
                    {
                        PRINTF("DSP USB playback start failed! return error = %d\r\n", msg->error);
                        USB_DeviceStop(g_composite.deviceHandle);
                        USB_DeviceAudioSpeakerStatusReset();
                        usb_playing = false;
                    }
                    else
                    {
                        PRINTF("DSP USB playback start\r\n");
                    }

                    /* Release shell to be able to set different EAP presets*/
                    *notify_shell = true;
                    break;

                case SRTM_Command_UsbSpeakerData:
                    msg->head.type = SRTM_MessageTypeResponse;

                    if ((USB_AudioSpeakerBufferSpaceUsed() < (g_composite.audioUnified.audioPlayTransferSize)) &&
                        (g_composite.audioUnified.startPlayFlag == 1U))
                    {
                        g_composite.audioUnified.startPlayFlag          = 0;
                        g_composite.audioUnified.speakerDetachOrNoInput = 1;
                    }
                    if (0U != g_composite.audioUnified.startPlayFlag)
                    {
#if defined(USB_DEVICE_AUDIO_USE_SYNC_MODE) && (USB_DEVICE_AUDIO_USE_SYNC_MODE > 0U)
#else
                        USB_DeviceCalculateFeedback();
#endif

                        msg->param[0]     = (uint32_t)(&audioPlayDataBuff[g_composite.audioUnified.tdReadNumberPlay]);
                        msg->param[1]     = g_composite.audioUnified.audioPlayTransferSize;
                        preAudioSendCount = g_composite.audioUnified.audioSendCount[0];
                        g_composite.audioUnified.audioSendCount[0] += g_composite.audioUnified.audioPlayTransferSize;
                        if (preAudioSendCount > g_composite.audioUnified.audioSendCount[0])
                        {
                            g_composite.audioUnified.audioSendCount[1] += 1U;
                        }
                        g_composite.audioUnified.audioSendTimes++;
                        g_composite.audioUnified.tdReadNumberPlay += g_composite.audioUnified.audioPlayTransferSize;
                        if (g_composite.audioUnified.tdReadNumberPlay >= g_composite.audioUnified.audioPlayBufferSize)
                        {
                            g_composite.audioUnified.tdReadNumberPlay = 0;
                        }
                        audioSpeakerPreReadDataCount = g_composite.audioUnified.audioSpeakerReadDataCount[0];
                        g_composite.audioUnified.audioSpeakerReadDataCount[0] +=
                            g_composite.audioUnified.audioPlayTransferSize;
                        if (audioSpeakerPreReadDataCount > g_composite.audioUnified.audioSpeakerReadDataCount[0])
                        {
                            g_composite.audioUnified.audioSpeakerReadDataCount[1] += 1U;
                        }
                    }
                    else
                    {
                        msg->param[0] = (uint32_t)(&audioPlayDMATempBuff[0]);
                        msg->param[1] = (0U != g_composite.audioUnified.audioPlayTransferSize) ?
                                            g_composite.audioUnified.audioPlayTransferSize :
                                            HS_ISO_OUT_ENDP_PACKET_SIZE;
                    }

