gillwei7/NXP_RT600/boards/mimxrt685audevk/dsp_examples/xaf_usb_demo/cm33/source/cmd.c
                    /* Send response message to DSP with new data */
                    dsp_ipc_send_sync(msg);

                    /* Don't release shell until receive notification of usb end */
                    *notify_shell = false;
                    break;

                case SRTM_Command_UsbSpeakerEnd:
                    PRINTF("DSP USB playback complete\r\n");

                    USB_DeviceStop(g_composite.deviceHandle);
                    USB_DeviceAudioSpeakerStatusReset();
                    usb_playing = false;

                    *notify_shell = true;
                    break;

                case SRTM_Command_UsbSpeakerStop:
                    if (msg->error != SRTM_Status_Success)
                    {
                        PRINTF("DSP USB stop failed! return error = %d\r\n", msg->error);
                    }
                    else
                    {
                        PRINTF("DSP USB stopped\r\n");
                        USB_DeviceStop(g_composite.deviceHandle);
                        USB_DeviceAudioSpeakerStatusReset();
                        usb_playing = false;
                    }

                    *notify_shell = true;
                    break;

                case SRTM_Command_UsbSpeakerError:
                    if (msg->error != SRTM_Status_Success)
                    {
                        PRINTF("DSP requested USB stop due to error failed! return error = %d\r\n", msg->error);
                    }
                    else
                    {
                        PRINTF("DSP USB stopped, unsupported format!!!.\r\n");
                        USB_DeviceStop(g_composite.deviceHandle);
                        USB_DeviceAudioSpeakerStatusReset();
                        usb_playing = false;
                    }

                    *notify_shell = true;
                    break;

                case SRTM_Command_UsbMicStart:
                    if (msg->error != SRTM_Status_Success)
                    {
                        PRINTF("DSP USB record start failed! return error = %d\r\n", msg->error);
                        USB_DeviceStop(g_composite.deviceHandle);
                        usb_recording = false;
                    }
                    else
                    {
                        PRINTF("DSP USB record start\r\n");
                    }

                    /* Release shell to be able to send different command */
                    *notify_shell = true;
                    break;

                case SRTM_Command_UsbMicData:
                    g_composite.audioUnified.tdWriteNumberRec = msg->param[0];
                    *notify_shell                             = true;
                    break;

                case SRTM_Command_UsbMicEnd:
                    PRINTF("DSP USB recording complete\r\n");

                    USB_DeviceStop(g_composite.deviceHandle);
                    USB_DeviceAudioRecorderStatusReset();
                    usb_recording = false;

                    *notify_shell = true;
                    break;

                case SRTM_Command_UsbMicStop:
                    if (msg->error != SRTM_Status_Success)
                    {
                        PRINTF("DSP USB stop failed! return error = %d\r\n", msg->error);
                    }
                    else
                    {
                        PRINTF("DSP USB stopped\r\n");
                        USB_DeviceStop(g_composite.deviceHandle);
                        USB_DeviceAudioRecorderStatusReset();
                        usb_recording = false;
                    }

                    *notify_shell = true;
                    break;

                case SRTM_Command_UsbMicError:
                    if (msg->error != SRTM_Status_Success)
                    {
                        PRINTF("DSP requested USB stop due to error failed! return error = %d\r\n", msg->error);
                    }
                    else
                    {
                        PRINTF("DSP USB stopped\r\n");
                        USB_DeviceStop(g_composite.deviceHandle);
                        USB_DeviceAudioRecorderStatusReset();
                        usb_recording = false;
                    }

                    *notify_shell = true;
                    break;

#if XA_CLIENT_PROXY
                case SRTM_Command_FilterCfg:
                {
                    if (msg->error != SRTM_Status_Success)
                    {
                        PRINTF("DSP Filter cfg failed! return error = %d\r\n", msg->error);
                    }
                    else
                    {
                        PRINTF("DSP Filter cfg success!\r\n");
                    }
                    *notify_shell = true;
                    break;
                }
#endif
                // TYM DSP add >>
                case SRTM_Command_FlowDSPSetParam:
                {
                	if (msg->error != SRTM_Status_Success)
                	{
                		PRINTF("DSP FlowDSP set parameter failed! return error = %d\r\n", msg->error);
                	}
                	else
                	{
                        if( FlowCmdStep == FlowCmd_Step0_PreFlowPathInit)
                        {
                            if( msg->flow_msg[0] == 'S' && msg->flow_msg[1] == 'u' && msg->flow_msg[2] == 'c')
                            {
                                PRINTF( msg->flow_msg, "%s");
                                FlowCmdStep = FlowCmd_Step1_Header1;
                            }
                            else
                            {
                                // Encounter some error
                                PRINTF( "Error on Flow Path initialize\r\n");
                            }
                        }
                        else
                        {
                            USART_Type *const s_UsartAdapterBase[] = USART_BASE_PTRS;
                            uint8_t dest[64];
                            memset(dest, 0, sizeof(dest));
                            dest[0] = 1;
                            dest[1] = 0;
                            dest[2] = 0;
                            dest[3] = msg->param[0];

                            memcpy( &dest[4], msg->flow_msg, msg->param[0] );
                            // TODO modify to serial manager write
                            USART_WriteBlocking(s_UsartAdapterBase[0], dest, 4 + msg->param[0]);
                        }
                	}
                	*notify_shell = true;
                	break;
                }
                // TYM DSP add <<
                default:
                    PRINTF("Incoming unknown message category %d \r\n", msg->head.category);
                    break;
            }
            break;
    }
}

void handleDSPMessage(app_handle_t *app, srtm_message *msg)
{
    bool notify_shell = false;

    handleDSPMessageInner(app, msg, &notify_shell);

    if (notify_shell)
    {
        /* Signal to shell that response has been processed. */
        if (app->shell_task_handle != NULL)
        {
            xTaskNotifyGive(app->shell_task_handle);
        }
    }
}
/*${function:end}*/
